[
  {
    "id": 1,
    "title": "Monolith to Microservices: Evolutionary Patterns to Transform Your Monolith",
    "author": "Sam Newman",
    "category": "Programming",
    "frontpage": "MonolithToMicroservices.jpg",
    "publisher": "O'Reilly Media",
    "release date": "December 24, 2019",
    "pages number": "272",
    "description": "How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture.",
    "publish date": "2025-08-23",
    "shared by": "Drolord22"
  },
  {
    "id": 2,
    "title": "AI and Machine Learning for Coders: A Programmer's Guide to Artificial Intelligence",
    "author": "Laurence Moroney",
    "category": "AI",
    "frontpage": "AIandMachineLearningforCoders.jpg",
    "publisher": "O'Reilly Media",
    "release date": "November 10, 2020",
    "pages number": "390",
    "description": "Welcome to AI and Machine Learning for Coders, a book that I’ve been wanting to write for many years but that has only really become possible due to recent advances in machine learning (ML) and, in particular, TensorFlow. The goal of this book is to prepare you, as a coder, for many of the scenarios that you can address with machine learning, with the aim of equipping you to be an ML and AI developer without needing a PhD! I hope that you’ll find it useful, and that it will empower you with the confidence to get started on this wonderful and rewarding journey.",
    "publish date": "2025-07-27",
    "shared by": "Drolord22"
  },
  {
    "id": 3,
    "title": "Begin to Code with JavaScript",
    "author": "Rob Miles",
    "category": "Programming",
    "frontpage": "BegintoCodewithJavaScript.jpg",
    "publisher": "Microsoft Press",
    "release date": "September 13, 2021",
    "pages number": "512",
    "description": "Start programming with this friendly, full-color book designed for absolute beginners. Learn by building real projects with interactive JavaScript samples right in your browser. Whether you're new or have tried before, this guide puts the fun and power of coding in your hands!",
    "publish date": "2025-07-27",
    "shared by": "Drolord22"
  },
  {
    "id": 4,
    "title": "Building a Career in Cybersecurity: The Strategy and Skills You Need to Succeed",
    "author": "Yuri Diogenes",
    "category": "Cybersecurity",
    "frontpage": "BuildingaCareerinCybersecurityTheStrategy.jpg",
    "publisher": "Addison-Wesley",
    "release date": "July 8, 2023",
    "pages number": "192",
    "description": "Cybersecurity is one of the world's fastest growing, most exciting fields--but that doesn't mean it's easy to enter the industry and succeed. Now there's a complete guide to creating a great cybersecurity career, whether you're migrating to cybersecurity from another field or already a cybersecurity professional.",
    "publish date": "2025-07-29",
    "shared by": "Drolord22"
  },
  {
    "id": 5,
    "title": "Building an API Product: Design, implement, release, and maintain API products that meet user needs",
    "author": "Bruno Pedro",
    "category": "Programming",
    "frontpage": "BuildinganAPIProduct.jpg",
    "publisher": "Packt Publishing",
    "release date": "January 25, 2024",
    "pages number": "278",
    "description": "Unlock the power of APIs with expert guidance and techniques for successfully creating, testing, and maintaining products that align with customers and stand out in the market",
    "publish date": "2025-07-29",
    "shared by": "Drolord22"
  },
  {
    "id": 6,
    "title": "C# and Algorithmic Thinking for the Complete Beginner Learn to Think Like a Programmer",
    "author": "Aristides Bouras",
    "category": "Programming",
    "frontpage": "CSharpandAlgorithmicThinking.jpg",
    "publisher": "Independently published",
    "release date": "May 14, 2024",
    "pages number": "676",
    "description": "Fully updated for the latest C#, this book is a beginner-friendly introduction to programming. It focuses on building strong Algorithmic Thinking skills—teaching problem-solving through coding for anyone eager to learn C# from scratch.",
    "publish date": "2025-07-29",
    "shared by": "Drolord22"
  },
  {
    "id": 7,
    "title": "Certified Information Security Manager Exam Prep Guide - Second Edition",
    "author": "Hemang Doshi",
    "category": "Cybersecurity",
    "frontpage": "CertifiedInformationSecurityManagerExamPrepGuide.jpg",
    "publisher": "Packt Publishing",
    "release date": "Dic 16, 2022",
    "pages number": "718",
    "description": "Purchase of the book unlocks access to web-based tools like practice questions, flashcards, and more to take your CISM prep to the next level.",
    "publish date": "2025-07-29",
    "shared by": "Drolord22"
  },
  {
    "id": 8,
    "title": "C# Interview Guide: Boost your confidence with answers to hundreds of secret interview questions",
    "author": "Konstantin Semenenko",
    "category": "Programming",
    "frontpage": "CSharpInterviewGuideBoostyourconfidence.jpg",
    "publisher": "Packt Publishing",
    "release date": "Mar 08, 2024",
    "pages number": "362",
    "description": "Catapult your C# journey with this guide to crafting standout resumes, mastering advanced concepts, and navigating job offers with real-world insights for unparalleled success in programming and interviews",
    "publish date": "2025-07-29",
    "shared by": "Drolord22"
  },
  {
    "id": 9,
    "title": "Cloud Penetration Testing: Learn how to effectively pentest AWS, Azure, and GCP applications",
    "author": "Kim Crawley",
    "category": "Hacking",
    "frontpage": "CloudPenetrationTestingLearnhowto.jpg",
    "publisher": "Packt Publishing",
    "release date": "November 24, 2023",
    "pages number": "298",
    "description": "Get to grips with cloud exploits, learn the fundamentals of cloud security, and secure your organization's network by pentesting AWS, Azure, and GCP effectively",
    "publish date": "2025-08-01",
    "shared by": "Drolord22"
  },
  {
    "id": 10,
    "title": "C++ Without Fear: A Beginner's Guide That Makes You Feel Smart",
    "author": "Brian Overland",
    "category": "Programming",
    "frontpage": "C++Without FearABeginnersGuide.jpg",
    "publisher": "Pearson",
    "release date": "December 20, 2015",
    "pages number": "615",
    "description": "Want to learn programming and C++, the language behind top games and software? C++ Without Fear, Third Edition is perfect for beginners, updated for C++14 and Microsoft Visual C++ Community Edition to get you coding quickly—even with no prior experience!",
    "publish date": "2025-08-01",
    "shared by": "Drolord22"
  },
  {
    "id": 11,
    "title": "Cybersecurity Blue Team Strategies",
    "author": "Kunal Sehgal, Nikolaos Thymianis",
    "category": "Cybersecurity",
    "frontpage": "CybersecurityBlueTeamStrategiesUncoverthesecrets.jpg",
    "publisher": "Packt Publishing",
    "release date": "February 28, 2023",
    "pages number": "208",
    "description": "This book is for cybersecurity professionals defending systems against attacks, including penetration testers, analysts, security leaders, and blue team members. CISOs securing their organizations will also benefit. Basic IT security knowledge is recommended.",
    "publish date": "2025-08-01",
    "shared by": "Drolord22"
  },
  {
    "id": 12,
    "title": "Cyber Threat Intelligence: The No-Nonsense Guide for Cisos and Security Managers",
    "author": "Aaron Roberts",
    "category": "Cybersecurity",
    "frontpage": "CyberThreatIntelligence.jpg",
    "publisher": "Apress",
    "release date": "August 10, 2021",
    "pages number": "195",
    "description": "Learn how to establish a successful cyber threat intelligence (CTI) practice within your security team. This book explains how collecting and analyzing threat data helps protect your organization by enabling proactive, intelligence-led security measures that prevent attacks rather than just respond to them.",
    "publish date": "2025-08-02",
    "shared by": "Drolord22"
  },
  {
    "id": 13,
    "title": "Deep Learning for Coders with Fastai and PyTorch: AI Applications Without a PhD",
    "author": "Jeremy Howard & Sylvain Gugger",
    "category": "Programming",
    "frontpage": "DeepLearningforCoderswithFastaiandPyTorch.jpg",
    "publisher": "O'Reilly Media",
    "release date": "August 25, 2020",
    "pages number": "624",
    "description": "Deep learning is often viewed as the exclusive domain of math PhDs and big tech companies. But as this hands-on guide demonstrates, programmers comfortable with Python can achieve impressive results in deep learning with little math background, small amounts of data, and minimal code. How? With fastai, the first library to provide a consistent interface to the most frequently used deep learning applications.",
    "publish date": "2025-08-02",
    "shared by": "Drolord22"
  },
  {
    "id": 14,
    "title": "Functional Programming in JavaScript",
    "author": "Luis Atencio",
    "category": "Programming",
    "frontpage": "FunctionalProgramminginJavaScriptHowtoimprove.jpg",
    "publisher": "Manning",
    "release date": "June 18, 2016",
    "pages number": "274",
    "description": "Functional Programming in JavaScript teaches JavaScript developers functional techniques that will improve extensibility, modularity, reusability, testability, and performance. Through concrete examples and jargon-free explanations, this book teaches you how to apply functional programming to real-life development tasks",
    "publish date": "2025-08-02",
    "shared by": "Drolord22"
  },
  {
    "id": 15,
    "title": "The Power of Generative AI for Object-Oriented Software Engineering with UML",
    "author": "Jim Arlow & Ila Neustadt",
    "category": "AI",
    "frontpage": "GenerativeAnalysisThePowerofGenerativeAI.jpg",
    "publisher": "Addison-Wesley Professional",
    "release date": "October 11, 2024",
    "pages number": "674",
    "description": "Generative AI is transforming software engineering by automating coding and changing required skills. Software professionals must now create precise analysis artifacts for AI code generation. Generative analysis offers a clear, structured approach to thrive in this AI-driven engineering landscape.",
    "publish date": "2025-08-03",
    "shared by": "Drolord22"
  },
  {
    "id": 16,
    "title": "Generative Deep Learning: Teaching Machines to Paint, Write, Compose, and Play",
    "author": "David Foster",
    "category": "AI",
    "frontpage": "GenerativeDeepLearning.jpg",
    "publisher": "O'Reilly Media",
    "release date": "August 6, 2019",
    "pages number": "456",
    "description": "Generative modeling is a hot AI topic, enabling machines to excel in painting, writing, and music. This practical book guides machine-learning engineers and data scientists in building powerful generative models like variational autoencoders, GANs, encoder-decoder models, and world models.",
    "publish date": "2025-08-03",
    "shared by": "Drolord22"
  },
  {
    "id": 17,
    "title": "Get Programming with JavaScript",
    "author": "John Larsen",
    "category": "Programming",
    "frontpage": "GetProgrammingwithJavaScript.jpg",
    "publisher": "Manning",
    "release date": "August 9, 2016",
    "pages number": "436",
    "description": "Ready to create web apps, games, and programs? Get Programming with JavaScript is a hands-on guide for absolute beginners. With clear examples, exercises, and no special tools needed, you'll learn to code using just your text editor and browser, plus live online demos to follow along.",
    "publish date": "2025-08-03",
    "shared by": "Drolord22"
  },
  {
    "id": 18,
    "title": "Practical Exercises on the Computational Subjects You Keep Avoiding (Like C)",
    "author": "Zed Shaw",
    "category": "Programming",
    "frontpage": "LearnCTheHardWay.png",
    "publisher": "Addison-Wesley Professional",
    "release date": "September 4, 2015",
    "pages number": "385",
    "description": "In Learn C the Hard Way, you’ll complete 52 hands-on exercises with Zed Shaw’s videos. Type the code yourself, fix errors, and watch programs run. You’ll learn modern C programming, improve problem-solving skills, and master defensive coding techniques to build secure, reliable software.",
    "publish date": "2025-08-05",
    "shared by": "Drolord22"
  },
  {
    "id": 19,
    "title": "GraphQL Best Practices",
    "author": "Artur Czemiel",
    "category": "Programming",
    "frontpage": "GraphQLBestPractices.jpg",
    "publisher": "Packt Publishing",
    "release date": "October 11, 2024",
    "pages number": "422",
    "description": "In the ever-evolving landscape of web development, GraphQL has emerged as a powerful query language that addresses the limitations of traditional REST APIs. This guide delves deep into GraphQL, starting with its foundational principles and swiftly advancing to complex topics that will equip you with the skills you need to understand this technology.",
    "publish date": "2025-08-05",
    "shared by": "Drolord22"
  },
  {
    "id": 20,
    "title": "Ghidra Software Reverse Engineering for Beginners: Analyze, identify, and avoid malicious code and potential threats in your networks and systems",
    "author": "David Álvarez Pérez",
    "category": "Cybersecurity",
    "frontpage": "ReverseEngineering.jpg",
    "publisher": "Packt Publishing",
    "release date": "8 enero 2021",
    "pages number": "322",
    "description": "",
    "publish date": "2025-08-05",
    "shared by": "Drolord22"
  },
  {
    "id": 21,
    "title": "Low-Code AI: A Practical Project-Driven Introduction to Machine",
    "author": "Gwendolyn Stripling & Michael Abel",
    "category": "AI",
    "frontpage": "Low-CodeAI.png",
    "publisher": "O'Reilly Media",
    "release date": "October 17, 2023",
    "pages number": "328",
    "description": "Take a data-first and use-case-driven approach with Low-Code AI to understand machine learning and deep learning concepts. This hands-on guide presents three problem-focused ways to learn no-code ML using AutoML, low-code using BigQuery ML, and custom code using scikit-learn and Keras. In each case, you'll learn key ML concepts by using real-world datasets with realistic problems.",
    "publish date": "2025-08-06",
    "shared by": "Drolord22"
  },
  {
    "id": 22,
    "title": "Microsoft Azure Network Security",
    "author": "Nicholas Dicola & Anthony Roman",
    "category": "Cybersecurity",
    "frontpage": "MicrosoftAzureNetworkSecurity.png",
    "publisher": "Microsoft Press",
    "release date": "June 14, 2021",
    "pages number": "205",
    "description": "Network security is crucial to safely deploying and managing Azure cloud resources in any environment. Now, two of Microsoft's leading experts present a comprehensive, cloud-native approach to protecting your network, and safeguarding all your Azure systems and assets. Nicholas DiCola and Anthony Roman begin with a thoughtful overview of network security's role in the cloud. Next, they offer practical, real-world guidance on deploying cloud-native solutions for firewalling, DDOS, WAF, and other foundational services - all within a best-practice secure network architecture based on proven design patterns.",
    "publish date": "2025-08-06",
    "shared by": "Drolord22"
  },
  {
    "id": 23,
    "title": "Practical Cybersecurity Architecture: A guide to creating and implementing robust designs for cybersecurity architects",
    "author": "Ed Moyle & Diana Kelley",
    "category": "Cybersecurity",
    "frontpage": "PracticalCybersecurityArchitecture.png",
    "publisher": "Packt Publishing",
    "release date": "November 20, 2020",
    "pages number": "418",
    "description": "Cybersecurity architects collaborate with stakeholders to understand business needs and design implementable, goal-driven security solutions aligned with organizational governance.",
    "publish date": "2025-08-07",
    "shared by": "Drolord22"
  },
  {
    "id": 24,
    "title": "PostgreSQL: Up and Running: A Practical Guide to the Advanced Open Source Database",
    "author": "Regina O. Obe & Leo S. Hsu",
    "category": "Databases",
    "frontpage": "PostgreSQLUpAndRunning.png",
    "publisher": "O'Reilly Media",
    "release date": "November 28, 2017",
    "pages number": "310",
    "description": "Thinking of migrating to PostgreSQL? This clear, fast-paced introduction helps you understand and use this open source database system. Not only will you learn about the enterprise class features in versions 9.5 to 10, you will also discover that PostgeSQL is more than a database system, it is an impressive application platform as well.",
    "publish date": "2025-08-07",
    "shared by": "Drolord22"
  },
  {
    "id": 25,
    "title": "Programming APIs with C# and .NET: Develop high-performance APIs that ensure seamless application communication and enhanced security",
    "author": "Jesse Liberty & Joseph Dluzen",
    "category": "Programming",
    "frontpage": "ProgrammingAPIsWithCSharpAndDotNet.png",
    "publisher": "Packt Publishing",
    "release date": "November 29, 2024",
    "pages number": "166",
    "description": "",
    "publish date": "2025-08-07",
    "shared by": "Drolord22"
  },
  {
    "id": 26,
    "title": "Quick Start Guide to Large Language Models: Strategies and Best Practices for Using ChatGPT and Other LLMs",
    "author": "Sinan Ozdemir",
    "category": "AI",
    "frontpage": "QuickStartGuidetoLargeLanguageModels.png",
    "publisher": "Addison-Wesley Data & Analytics Series",
    "release date": "September 11, 2023",
    "pages number": "386",
    "description": "Large Language Models (LLMs) like ChatGPT are demonstrating breathtaking capabilities, but their size and complexity have deterred many practitioners from applying them. In Quick Start Guide to Large Language Models, pioneering data scientist and AI entrepreneur Sinan Ozdemir clears away those obstacles and provides a guide to working with, integrating, and deploying LLMs to solve practical problems.",
    "publish date": "2025-08-08",
    "shared by": "Drolord22"
  },
  {
    "id": 27,
    "title": "Rails Crash Course: A No-Nonsense Guide to Rails Development",
    "author": "Anthony Lewis",
    "category": "Programming",
    "frontpage": "RailsCrashCourse.png",
    "publisher": "Addison-Wesley Data & Analytics Series",
    "release date": "October 08, 2014",
    "pages number": "298",
    "description": "Rails is a robust, flexible development platform that lets you build complex websites quickly. Major websites like GitHub, Hulu, and Twitter have run Rails under the hood, and if you know just enough HTML and CSS to be dangerous, Rails Crash Course will teach you to harness Rails for your own projects and create web applications that are fast, stable, and secure.",
    "publish date": "2025-08-08",
    "shared by": "Drolord22"
  },
  {
    "id": 28,
    "title": "React Hooks in Action: With Suspense and Concurrent Mode",
    "author": "John Larsen",
    "category": "Programming",
    "frontpage": "ReactHooksInAction.png",
    "publisher": "Manning",
    "release date": "April 13, 2021",
    "pages number": "376",
    "description": "Create sleek, fast-loading user interfaces in React without custom classes. React Hooks let you manage state, lifecycle, and side effects in functional components. React Hooks in Action guides you through using hooks like useState, useReducer, and useEffect to build reusable, efficient code and become a more effective React developer.",
    "publish date": "2025-08-08",
    "shared by": "Drolord22"
  },
  {
    "id": 29,
    "title": "Operating Systems: Three Easy Pieces",
    "author": "Remzi H. Arpaci-Dusseau & Andrea C. Arpaci-Dusseau",
    "category": "OS",
    "frontpage": "OperatingSystemsThreeEasyPieces.jpg",
    "publisher": "Arpaci-Dusseau Books, LLC",
    "release date": "September 1, 2018",
    "pages number": "714",
    "description": "OSTEP ('Oh Step'), or the 'the comet book', is a widely used textbook that introduces key concepts in Operating Systems in an accessible way. Organized into three sections—virtualization, concurrency, and persistence—this book provides students and professionals with a clear understanding of OS principles. Written by professors at the University of Wisconsin–Madison, it blends academic rigor with practical clarity.",
    "publish date": "2025-08-07",
    "shared by": "Yael"
  },
  {
    "id": 30,
    "title": "Ruby on Rails Tutorial: Learn Web Development with Rails",
    "author": "Michael Hartl",
    "category": "Programming",
    "frontpage": "RubyOnRailsTutorial.png",
    "publisher": "Addison-Wesley Professional",
    "release date": "January 1, 2023",
    "pages number": "889",
    "description": "Used by Hulu, GitHub, Shopify, and Airbnb, Ruby on Rails is a leading web development framework. Whether you're new to web development or just Rails, Ruby on Rails™ Tutorial, Seventh Edition is the perfect guide to get you started.",
    "publish date": "2025-08-11",
    "shared by": "Drolord22"
  },
  {
    "id": 31,
    "title": "Ruby by Example: Concepts and Code",
    "author": "Kevin C. Baird",
    "category": "Programming",
    "frontpage": "RubyByExample.png",
    "publisher": "No Starch Press",
    "release date": "June 8, 2007",
    "pages number": "313",
    "description": "There may be no better way to learn how to program than by dissecting real, representative examples written in your language of choice. Ruby by Example analyzes a series of Ruby scripts, examining how the code works, explaining the concepts it illustrates, and showing how to modify it to suit your needs. Baird's examples demonstrate key features of the language (such as inheritance, encapsulation, higher-order functions, and recursion), while simultaneously solving difficult problems (such as validating XML, creating a bilingual program, and creating command-line interfaces).",
    "publish date": "2025-08-11",
    "shared by": "Drolord22"
  },
  {
    "id": 32,
    "title": "Beginning C++ Game Programming: Learn C++ from scratch by building fun games",
    "author": "John Horton",
    "category": "Programming",
    "frontpage": "BeginningC++GameProgramming.png",
    "publisher": "Packt Publishing",
    "release date": "May 31, 2024",
    "pages number": "659",
    "description": "Always dreamed of creating your own games? Beginning C++ Game Programming, 3rd Edition helps you make that dream real! Updated with VS 2022, SFML, and modern C++20, this beginner-friendly guide walks you through building four fully playable games—from Timberman and Pong to a zombie survival shooter and an endless runner.",
    "publish date": "2025-08-11",
    "shared by": "Drolord22"
  },
  {
    "id": 33,
    "title": "Securing 5G and Evolving Architectures",
    "author": "Pramod Nair",
    "category": "Cybersecurity",
    "frontpage": "Securing5G.png",
    "publisher": "Addison-Wesley Professional",
    "release date": "December 10, 2021",
    "pages number": "619",
    "description": "Securing 5G and Evolving Architectures is for technical and management audiences at all levels of 5G experience---from enterprise and security architects to network engineers, cloud computing and data center professionals, to CSO and CTO teams.",
    "publish date": "2025-08-12",
    "shared by": "Drolord22"
  },
  {
    "id": 34,
    "title": "The C++ Workshop: Learn to write clean, maintainable code in C++ and advance your career in software engineering",
    "author": "Dale Green, Kurt Guntheroth & Shaun Ross Mitchell",
    "category": "Programming",
    "frontpage": "TheC++Workshop.png",
    "publisher": "Packt Publishing",
    "release date": "February 7, 2020",
    "pages number": "605",
    "description": "",
    "publish date": "2025-08-12",
    "shared by": "Drolord22"
  },
  {
    "id": 35,
    "title": "C++ High Performance: Master the art of optimizing the functioning of your C++ code",
    "author": "Bjorn Andrist, Viktor Sehr & Ben Garney",
    "category": "Programming",
    "frontpage": "C++HighPerformance.png",
    "publisher": "Packt Publishing",
    "release date": "December 30, 2020",
    "pages number": "545",
    "description": "A comprehensive guide for C++ developers to boost app performance by making them faster and more resource-efficient. C++ High Performance, Second Edition teaches you how to optimize your code without sacrificing readability.",
    "publish date": "2025-08-12",
    "shared by": "Drolord22"
  },
  {
    "id": 36,
    "title": "Simplifying JavaScript: Writing Modern JavaScript with ES5, ES6, and Beyond",
    "author": "Joe Morgan",
    "category": "Programming",
    "frontpage": "SimplifyingJavascript.png",
    "publisher": "Pragmatic Bookshelf",
    "release date": "May 22, 2018",
    "pages number": "279",
    "description": "The best modern JavaScript is simple, readable, and predictable. This guide teaches you to write better code through practical examples—not just syntax memorization. Learn how modern features like clear variable declarations, array methods, curried functions, and classes lead to cleaner, more expressive, and less error-prone code.",
    "publish date": "2025-08-13",
    "shared by": "Drolord22"
  },
  {
    "id": 37,
    "title": "Spring Boot 3.0 Cookbook: Proven recipes for building modern and robust Java web applications with Spring Boot",
    "author": "Felip Miguel Puig",
    "category": "Programming",
    "frontpage": "SpringBoot3Dot0Cookbook.png",
    "publisher": "Packt Publishing",
    "release date": "July 12, 2024",
    "pages number": "426",
    "description": "",
    "publish date": "2025-08-13",
    "shared by": "Drolord22"
  },
  {
    "id": 38,
    "title": "Pentesting API's: A practical guide to discovering, fingerprinting and exploting API's",
    "author": "Mauricio Harley",
    "category": "Hacking",
    "frontpage": "PentestingAPIS.png",
    "publisher": "Packt Publishing",
    "release date": "September 27, 2024",
    "pages number": "290",
    "description": "This book begins by establishing a foundational understanding of APIs, particularly focusing on REST and GraphQL, emphasizing their critical role and potential security vulnerabilities. It guides you through setting up a penetration testing environment to ensure the practical application of concepts.",
    "publish date": "2025-08-16",
    "shared by": "Drolord22"
  },
  {
    "id": 39,
    "title": "Shell Programming in Unix, Linux and OS X - Fourth Edition",
    "author": "Stephen G. Kochan & Patrick Wood",
    "category": "OS",
    "frontpage": "Shell Programming in Unix, Linux and OS X - Fourth Edition.jpg",
    "publisher": "Addison-Wesley Professional",
    "release date": "August 30, 2016",
    "pages number": "416",
    "description": "This thoroughly revised fourth edition presents shell scripting across major Unix-based systems including Linux, macOS (OS X), and Solaris. It guides readers through essential concepts like variables, control structures, functions, debugging, and advanced features such as regular expressions and shell environment customization. Suitable for both beginners and seasoned users.",
    "publish date": "2025-08-16",
    "shared by": "Yael"
  },
  {
    "id": 40,
    "title": "TCP-IP Illustrated, Volume 1 The Protocols, Second Edition",
    "author": "W. Richard Stevens & Kevin R. Fall",
    "category": "OS",
    "frontpage": "TCP-IP Illustrated, Volume 1 The Protocols, Second Edition.jpg",
    "publisher": "Addison‑Wesley Professional",
    "release date": "November 15, 2011",
    "pages number": "1056",
    "description": "An updated, richly illustrated and deeply technical guide to the TCP/IP protocol suite. Building on Stevens’ classic first edition, Kevin R. Fall expands coverage to modern networking topics—IPv6, DHCP, NAT, firewalls, security protocols, and more—using real-world examples and packet traces to show how protocols function and why.",
    "publish date": "2025-08-16",
    "shared by": "Yael"
  }
]
